Revit 2024 API
FabricSheet.IsSingleFabricSheetWithinHost Method
 Identifies if the specified single Fabric Sheet position is within the host.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsSingleFabricSheetWithinHost(
	Element hostElement,
	Transform transform
)
Visual Basic
Public Function IsSingleFabricSheetWithinHost ( _
	hostElement As Element, _
	transform As Transform _
) As Boolean
Visual C++
public:
bool IsSingleFabricSheetWithinHost(
	Element^ hostElement,
	Transform^ transform
)
Parameters
hostElement
Type: Autodesk.Revit.DB.Element
 A structural element that will host the Fabric Sheet.
transform
Type: Autodesk.Revit.DB.Transform
 The transform that defines the placement of the instance single Fabric Sheet.
Return Value
 True if the single Fabric Sheet instance is within the host, false if the single Fabric Sheet instance is out of host.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace